Autodesk.Revit.Utility.AssetUtils.ExtractRPCBlobFromAsset(Autodesk.Revit.Utility.Asset,System.IntPtr,System.Int32)
Extract the RPC property blob by giving Asset and write it into an input buffer.
asset:
The asset to extract, only supports RPC assets.
buffer:
The memory buffer to save the extracted data.
If it is null, it returns the required buffer size.
bufferSize:
The buffer size of the memory to save the extracted data.
If it is 0, it returns the required buffer size.
Returns:
The actual number of RPC property blob placed in the buffer (can be less than the
length of the buffer).  If there are no enough memory buffer available, return 0.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The asset parameter was NULL.
Since:
2015

Autodesk.Revit.Utility.AssetUtils
A collection of utilities related to Asset class.
Since:
2015